tap "homebrew/bundle"
tap "homebrew/cask-versions"

# Programming languages related

brew "ruby"
brew "python3"
brew "pipenv"
brew "asciinema"
brew "bash"
brew "swiftLint"
brew "carthage"
brew "ccat"
brew "fastlane"
brew "git"
brew "git-extras"
brew "openssl"
brew "zsh-completions"
brew "romkatv/powerlevel10k/powerlevel10k"
brew "tree"

# Applications

cask_args appdir: "/Applications"

cask "iterm2"
cask "atom"
cask "postman"
cask "slack"
cask "Rectangle"
cask "the-unarchiver"
cask "fork"
cask "obsidian"
cask "spotify"
cask "cheatsheet"